---
kind: method
id: M:Autodesk.Revit.DB.PartMaker.GetSourceElementIds
source: html/2c7e323a-070c-977f-3de8-ea09fc86023a.htm
---
# Autodesk.Revit.DB.PartMaker.GetSourceElementIds Method

Get the source elements for the PartMaker.

## Syntax (C#)
```csharp
public ICollection<LinkElementId> GetSourceElementIds()
```

## Returns
Elements that are the sources for this PartMaker.